import React from 'react';
import styled from "styled-components";

const Div = styled.div`
  height: 3550px;
  padding: 10px 300px;
  background-color: #000000;
  color: white;
`

const H1 = styled.h1`
  color: #ffffff;
  margin-bottom: 20px;
`

const Div1 = styled.div`
margin-bottom: 20px;
`

const Text = styled.div`
margin-bottom: 20px;
`

const H2 = styled.h2`
  margin-bottom: 20px;
`

const H3 = styled.h3`
  margin-bottom: 20px;
`

const Rights = () => {
  return (
    <Div>
      <H1>Политика конфиденциальности</H1>
      <Div1>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую Сайт может получить о Пользователе во время просмотра сайта.</Div1>
      <H2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</H2>
      <Div1><Text>1.1 В настоящей Политике конфиденциальности используются следующие термины:</Text>
      <Text>1.1.1. «Администрация сайта» – уполномоченные сотрудники на управление сайтом, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</Text>
<Text>1.1.2. «Персональные данные» — любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</Text>
<Text>1.1.3. «Обработка персональных данных» — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</Text>
<Text>1.1.4. «Конфиденциальность персональных данных» — обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</Text>
<Text>1.1.5. «Пользователь сайта» (далее - Пользователь) – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.</Text>
<Text>1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</Text>
<Text>1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</Text></Div1>
      <H2>2. ОБЩИЕ ПОЛОЖЕНИЯ</H2>
      <Div1><Text>2.1. Использование Пользователем Сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</Text>
<Text>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта.</Text>
<Text>2.3. Настоящая Политика конфиденциальности применяется только к данному сайту. Администрация сайта не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте.</Text>
<Text>2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем Сайта.</Text></Div1>
      <H2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</H2>
      <Div1><Text>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на Сайте или при оформлении заказа для приобретения Товара, оказания Услуг или выполнения Работ.</Text>
<Text>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения формы на Сайте и могут включать в себя следующую информацию:</Text>
<Text>3.2.1. фамилию, имя, отчество Пользователя;</Text>
<Text>3.2.2. контактный телефон Пользователя;</Text>
<Text>3.2.3. адрес электронной почты (e-mail);</Text>
<Text>3.2.4. адрес доставки Товара или место оказания Услуг (если требуется);</Text>
<Text>3.2.5. место жительство Пользователя (если требуется).</Text>
<Text>3.3. Сайт защищает Данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы («пиксель»):</Text>
<Text><ul>
  <li>IP адрес;</li>
  <li>информация из cookies;</li>
  <li>информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);</li>
  <li>время доступа;</li>
  <li>адрес страницы, на которой расположен рекламный блок;</li>
  <li>реферер (адрес предыдущей страницы).</li>
</ul></Text>
<Text>3.3.1. Отключение cookies может повлечь невозможность доступа к частям Сайта, требующим авторизации.</Text>
<Text>3.3.2. Сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.</Text>
<Text>3.4. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.</Text></Div1>
    <H2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</H2>
    <Div1>4.1. Персональные данные Пользователя Администрация сайта может использовать в целях:
<br/>
<br/>
4.1.1. Идентификации Пользователя, зарегистрированного на Сайте, для оформления заказа и (или) заключения Договора купли-продажи товара либо оказания услуг дистанционным способом.
<br/>
<br/>
4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта.
<br/>
<br/>
4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг, обработка запросов и заявок от Пользователя.
<br/>
<br/>
4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.
<br/>
<br/>
4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
<br/>
<br/>
4.1.6. Создания учетной записи для совершения покупок либо заказа услуг, если Пользователь дал согласие на создание учетной записи.
<br/>
<br/>
4.1.7. Уведомления Пользователя Сайта о состоянии Заказа.
<br/>
<br/>
4.1.8. Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на получение кредитной линии Пользователем.
<br/>
<br/>
4.1.9. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта.
<br/>
<br/>
4.1.10. Предоставления Пользователю с его согласия, обновлений продукции либо услуг, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Сайта или от имени партнеров Сайта.
<br/>
<br/>
4.1.11. Осуществления рекламной деятельности с согласия Пользователя.
<br/>
<br/>
4.1.12. Предоставления доступа Пользователю на сайты или сервисы партнеров Сайта с целью получения продуктов, обновлений и услуг.</Div1>
    <H2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</H2>
    <Div1>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
    <br/>
<br/>
5.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте, включая доставку Товара, оказания Услуг или выполнения Работ.
<br/>
<br/>
5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
<br/>
<br/>
5.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.
<br/>
<br/>
5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
<br/>
<br/>
5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</Div1>
    <H2>6. ОБЯЗАТЕЛЬСТВА СТОРОН</H2>
    <H3>6.1. Пользоват8ель обязан:</H3>
    <Div1>
6.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом.
<br/>
<br/>
6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</Div1>
    <H3>6.2. Администрация сайта обязана:</H3>
    <Div1>6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
    <br/>
    <br/>
6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.
<br/>
<br/>
6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
<br/>
<br/>
6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</Div1>
    <H2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</H2>
    <Div1>7.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.
    <br/>
    <br/>
7.2. В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт ответственность, если данная конфиденциальная информация:
<br/>
<br/>
7.2.1. Стала публичным достоянием до её утраты или разглашения.
<br/>
<br/>
7.2.2. Была получена от третьей стороны до момента её получения Администрацией сайта.
<br/>
<br/>
7.2.3. Была разглашена с согласия Пользователя.</Div1>
    <H2>8. РАЗРЕШЕНИЕ СПОРОВ</H2>
    <Div1>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).
    <br/>
    <br/>
8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
<br/>
<br/>
8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Российской Федерации.
<br/>
<br/>
8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Российской Федерации.</Div1>
    <H2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</H2>
    <Div1>9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
    <br/>
    <br/>
9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.</Div1>
    <br/>
    </Div>
  );
}

export default Rights